In [ ]:
#Assignment 1

In [1]:
import pandas as pd

In [3]:
scores={
    'Name':['Kevin','Samuel','Samson','Caroline','Hellen'],
    'Math':[30,78,66,89,47],
    'Science':[78,90,43,90,23],
    'English':[56,78,45,56,66]
}

In [4]:
scores

{'Name': ['Kevin', 'Samuel', 'Samson', 'Caroline', 'Hellen'],
 'Math': [30, 78, 66, 89, 47],
 'Science': [78, 90, 43, 90, 23],
 'English': [56, 78, 45, 56, 66]}

In [5]:
student_score=pd.DataFrame(scores)

In [6]:
student_score

       Name  Math  Science  English
0     Kevin    30       78       56
1    Samuel    78       90       78
2    Samson    66       43       45
3  Caroline    89       90       56
4    Hellen    47       23       66

In [10]:
student_score['Average']=student_score[['Math','Science','English']].mean(axis=1)

In [11]:
student_score

       Name  Math  Science  English    Average
0     Kevin    30       78       56  54.666667
1    Samuel    78       90       78  82.000000
2    Samson    66       43       45  51.333333
3  Caroline    89       90       56  78.333333
4    Hellen    47       23       66  45.333333

In [12]:
student_score.Average.max()

82.0

In [16]:
student_score.sort_values(by='Average',ascending=False)

       Name  Math  Science  English    Average
1    Samuel    78       90       78  82.000000
3  Caroline    89       90       56  78.333333
0     Kevin    30       78       56  54.666667
2    Samson    66       43       45  51.333333
4    Hellen    47       23       66  45.333333

In [ ]:
#Assignment 2

In [19]:
DegTemp=[20,78,94,34,76]
farenheit_temperatures=[((y*9/5)+32) for y in DegTemp]

In [20]:
farenheit_temperatures

[68.0, 172.4, 201.2, 93.2, 168.8]